Revit 2027 API
Form.GetCurvesAndEdgesReference Method
Given a point, return all edges and curves that it is lying on.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceArray GetCurvesAndEdgesReference(
	Reference pointReference
)
Public Function GetCurvesAndEdgesReference (
	pointReference As Reference
) As ReferenceArray
public:
ReferenceArray^ GetCurvesAndEdgesReference(
	Reference^ pointReference
)
member GetCurvesAndEdgesReference :
        pointReference : Reference -> ReferenceArray
Parameters
pointReference Reference
The reference of a point.
Return Value
ReferenceArray
Reference array containing all edges and curves that the point is lying on.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace